import openpyxl as excl
#from lessonCode import writeFile, execution as e
import os

banksSummary = {}

#Есть слово банк, есть запятая, есть пробел. Первый элемент есть счет, который нам интересен
def processBank(contents):
        return ''


def runAnalysis():
        # Первая клетка – компания

        #какие строчки рассмартривать
        # Для выбранных строчек из шага 1:
        # 1.Месяц определяется словом ‘оборот’
        # 2.Каждый месяц
        # 3.Если не мета-данные, смотрим на дебит
        # 4.Делаем общую сумму
        # 5.Делаем сумму по холдинговым компаниям

        #cохранить результат


#Определяем какие строчки рассматривать на основе колнки А
def defineTheRange(banks, colA, companyName, paymentStartIndex):
            # если есть слово 'банк'
            # Мы начинаем смотреть на поступления начиная со строки в которой есть ‘поступлен’ и ‘продаж’
            # Мы начинаем смотреть на поступления начиная со строки в которой есть ‘поступлен’ и ‘продаж’


runAnalysis()
