# Заполните инструкции внизу
# Если вы видите в консоле "Process finished with exit code 0"
# запустите правильный файл _Test

#1 бал
#cоздайте функцию с именем exampleOne, у которой будет два входных параметра.
#верните True если они не одинаковы

#1 бал
#cоздайте функцию с именем exampleTwo, у которой будет три входных параметра.
#верните True если все три параметра равны друг другу


#1 бал
#cоздайте функцию с именем exampleThree, у которой будет три входных параметра.
#верните True если первый отличен от второго, либо второй равен третьему


#2 бала
#cоздайте функцию с именем exampleFour, у которой будут два текстовых входных параметра.
#если второй парметр является частью первого -- верните последнюю букву первого параметра
#если второй парметр не является частью первого -- верните первую букву первого параметра
#подсказка: любой текстовый элемент string -- это array букв


#2 бала
#cоздайте функцию с именем exampleFive, у которой будет три входных параметра: один array и два простых.
#верните "One", если первый элемент есть в array
#верните "Two", если второй элемент есть в array
#вените "None", если ни один из элементов не находиться в array


#3 бала
#cоздайте функцию с именем exampleSix, у которой будет три входных параметра: один array и два простых.
#верните "Success" если второго элемента нет в array и количество элементов в array'е соответсвует третьему элементу
#верните "Not In Success" если второго элемента нет в array и количество элементов в array'е не соответсвует третьему элементу
#верните "Length Success" если второй элемент есть в array и количество элементов в array'е соответсвует третьему элементу
#верните "Failure" если второй элемент есть в array и количество элементов в array'е не соответсвует третьему элементу
