#1 point
#создайте функцию exampleOne с одним входным параметром
#входной параметр есть массив чисел
#возведите каждый элемент в квадрат и верните их в новом массиве



#2 points
#создайте функцию exampleTwo с одним входным параметром
#входной параметр есть массив чисел
#верните два последних элемента в новом массиве с 100 добавленных к каждому из них
#т.е. [1,2,3] -> [102,103]


#2 points
#создайте функцию exampleThree с одним входным параметром
#входной параметр есть массив случайных значений
#верните четные элементы массива т.е. 2ой, 4ый, 6ой, и т.д.


#5 points
#создайте функцию exampleFour с двумя входными параметрами
#первый входной параметр есть массив чисел, второй единственное число
#если элемент равен 7 и 12 -- сразу же прекратите выполнение цикла
#если элемент делится на второй входной параметр без остатка, добавьте его в массив для возврата
#убедитесь что каждый элемент в массиве для возврата является текстом, а не числом
#верните трансформированный массив
#подсказка: остаток считается через %, т.е. 7%2 = 1