def combineStringNumsSmart():
  #  создайте переменную равную 185
  a = 185
  #  оздайте переменную равную Data Science Academy
  b = "Data Science Academy"
  #  создайте переменную равную В чате хххх на данный момент ХХХ студентов
  c = "В чате {} на данный момент {} студентов"
  return print(c.format(a, b))
  #  скомбинируйте все перменные чтобы получить В чате Data Science Academy на данный момент 185 студентов

combineStringNumsSmart()

#  arrays
def simpleArrayString():
  #  создайте переменную равную "The population of the Roman Empire was XX million at 25BC"
  #  создайте массив с элементами 125.5, 56.8, 12.1
  return ()# скомбинируйте все перменные чтобы получить "The population of the Roman Empire was 56.8 million at 25BC"

# arrays2
def addingArrayString():
  #  создайте переменную равную "The population of the Roman Empire was XX million at 25BC"
  #  создайте пустой массив
  #  добавьте  12.1
  #  добавьте  18.1
  #  добавьте  56.8
  return () # скомбинируйте все перменные чтобы получить "The population of the Roman Empire was 56.8 million at 25BC" "The population of the Roman Empire was 56.8 million at 25BC"


  #  arrays3
def measuringLengthofArray():
  #  создайте переменную равную "Квинтилий Вар потерял XX легионов в Германии: XXX, XXX, и XXX"
  #  создайте массив с элементами  Legio XVII, Legio XVIII and Legio XIX
  return ()# скомбинируйте все перменные чтобы получить "Квинтилий Вар потерял 3 легиона в Германии: Legio XIX, Legio XVII, и Legio XVIII"

#  iteration
def doIterations():
  #  создайте массив с элементами BSC, LEH, WB
  #  создайте переменную равную \n XXX обанкротился
  #  создайте пустую текстовую переменную, которая будет использована для финального результата
  #  для каждого элемента в массиве
  #  добавьте "\n %ЭЛЕМЕНТ% обанкротился" к тому, что уже есть в финальной текстовой переменной
  #  напечатайте финальную переменную
  return ()#верните финальный результат, чтобы он выглядел как \n BSC обанкротился\n LEH обанкротился\n WB обанкротился


def doRangeIteration():
  #  создайте пустой массив
  #  для каждого числа от 1 до 1000
  #  добавьте его к начальному массиву
  return ()#  верните массив

def doDictionary():
    # создайте словарь со следующими парами ключ-значение Нерва-98, Траян-117, Адриан-138
    # создайте переменную равную Траян
    # создайте переменную XXXXX умер в XXX г н.э.
    return ()#использую только переменные наверху верните Траян умер в 117 г н.э.

def myFirstFunction(key,value):
    #  создайте переменную \nXXXXX умер в XXX г н.э.
    return  #верните заформативрованные текст используя параметры как  as in \n Адриан умер в 138 г н.э.

def doFunctionCalling():
    #  создайте словарь со следующими парами ключ-значение Нерва-98, Траян-117, Адриан-138
    #  создайте пустую текстовую переменную, которая будет использована для финального результата
    #  для каждой комбинации ключ-значение
    #  добавьте результат функции уже к имеющемуся результату
   return() #верните финальный результат в форме \n Нерва умер в 98 г н.э.\n Траян умер в 117 г н.э.\n Адриан умер в 138 г н.э.




